---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.IsValidSegmentId(System.Int32)
source: html/33b70a25-cd65-f58f-e8c7-a0f6bc492be1.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.IsValidSegmentId Method

Verifies if a valid segment id.

## Syntax (C#)
```csharp
public bool IsValidSegmentId(
	int segmentId
)
```

## Parameters
- **segmentId** (`System.Int32`) - The segment id to be verified.

## Returns
True if the id is a valid segment id, otherwise false.